.emacs.d/emacs-saves/#!Users!nikhilsoni!Downloads!Re%253a_API_approach_documents (1)!Payment_WebService.txt#

<?xml version="1.0" encoding="UTF-8"?><wsdl:definitions
name="SIOA_Corporate_Payment_WebService"
targetNamespace="http://axis.com/payment/generic_payments"
xmlns:p1="http://axis.com/payment/generic_payments"
xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy"
xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"><wsdl:documentation/><wsp:UsingPolicy
wsdl:required="true"/><wsp:Policy
wsu:Id="OP_SIOA_Corporate_Payment_WebService"/><wsdl:types><xsd:schema
targetNamespace="http://axis.com/payment/generic_payments"
xmlns="http://axis.com/payment/generic_payments"
xmlns:xsd="http://www.w3.org/2001/XMLSchema"><xsd:element
name="MTO_Corporate_Payment_WebService"
type="DTO_Corporate_Payment_WebService"/><xsd:complexType
name="DTO_Corporate_Payment_WebService"><xsd:sequence><xsd:element
name="Record"><xsd:complexType><xsd:sequence><xsd:element
name="Payment_Details" minOccurs="0"
maxOccurs="unbounded"><xsd:complexType><xsd:sequence><xsd:element
name="API_VERSION" type="xsd:string"/><xsd:element name="CORP_CODE"
type="xsd:string"/><xsd:element name="CMPY_CODE"
type="xsd:string"/><xsd:element name="TXN_CRNCY"
type="xsd:string"/><xsd:element name="TXN_PAYMODE"
type="xsd:string"/><xsd:element name="CUST_UNIQ_REF"
type="xsd:string"/><xsd:element name="TXN_TYPE"
type="xsd:string"/><xsd:element name="TXN_AMOUNT"
type="xsd:decimal"/><xsd:element name="CORP_ACC_NUM"
type="xsd:string"/><xsd:element name="CORP_IFSC_CODE"
type="xsd:string" minOccurs="0"/><xsd:element name="ORIG_USERID"
type="xsd:string"/><xsd:element name="USER_DEPARTMENT"
type="xsd:string" minOccurs="0"/><xsd:element name="TRANSMISSION_DATE"
type="xsd:dateTime"/><xsd:element name="BENE_CODE"
type="xsd:string"/><xsd:element name="VALUE_DATE"
type="xsd:date"/><xsd:element name="RUN_IDENTIFICATION"
type="xsd:string" minOccurs="0"/><xsd:element name="FILE_NAME"
type="xsd:string" minOccurs="0"/><xsd:element name="BENE_NAME"
type="xsd:string"/><xsd:element name="BENE_ACC_NUM"
type="xsd:string"/><xsd:element name="BENE_IFSC_CODE"
type="xsd:string" minOccurs="0"/><xsd:element name="BENE_AC_TYPE"
type="xsd:string" minOccurs="0"/><xsd:element name="BENE_BANK_NAME"
type="xsd:string" minOccurs="0"/><xsd:element name="BASE_CODE"
type="xsd:string" minOccurs="0"/><xsd:element name="CHEQUE_NUMBER"
type="xsd:string" minOccurs="0"/><xsd:element name="CHEQUE_DATE"
type="xsd:date" minOccurs="0"/><xsd:element name="PAYABLE_LOCATION"
type="xsd:string" minOccurs="0"/><xsd:element name="PRINT_LOCATION"
type="xsd:string" minOccurs="0"/><xsd:element name="PRODUCT_CODE"
type="xsd:string" minOccurs="0"/><xsd:element name="BATCH_ID"
type="xsd:string" minOccurs="0"/><xsd:element name="BENE_ADDR_1"
type="xsd:string" minOccurs="0"/><xsd:element name="BENE_ADDR_2"
type="xsd:string" minOccurs="0"/><xsd:element name="BENE_ADDR_3"
type="xsd:string" minOccurs="0"/><xsd:element name="BENE_CITY"
type="xsd:string" minOccurs="0"/><xsd:element name="BENE_STATE"
type="xsd:string" minOccurs="0"/><xsd:element name="BENE_PINCODE"
type="xsd:string" minOccurs="0"/><xsd:element name="CORP_EMAIL_ADDR"
type="xsd:string" minOccurs="0"/><xsd:element name="BENE_EMAIL_ADDR1"
type="xsd:string" minOccurs="0"/><xsd:element name="BENE_EMAIL_ADDR2"
type="xsd:string" minOccurs="0"/><xsd:element name="BENE_MOBILE_NO"
type="xsd:string" minOccurs="0"/><xsd:element name="INVOICE_NUMBER"
type="xsd:string" minOccurs="0"/><xsd:element name="INVOICE_DATE"
type="xsd:string" minOccurs="0"/><xsd:element name="NET_AMOUNT"
type="xsd:decimal" minOccurs="0"/><xsd:element name="TAX"
type="xsd:decimal" minOccurs="0"/><xsd:element name="CASH_DISCOUNT"
type="xsd:decimal" minOccurs="0"/><xsd:element name="INVOICE_AMOUNT"
type="xsd:decimal" minOccurs="0"/><xsd:element name="ENRICHMENT1"
type="xsd:string" minOccurs="0"/><xsd:element name="ENRICHMENT2"
type="xsd:string" minOccurs="0"/><xsd:element name="ENRICHMENT3"
type="xsd:string" minOccurs="0"/><xsd:element name="ENRICHMENT4"
type="xsd:string" minOccurs="0"/><xsd:element name="ENRICHMENT5"
type="xsd:string" minOccurs="0"/><xsd:element name="STATUS_ID"
type="xsd:string"
minOccurs="0"/></xsd:sequence></xsd:complexType></xsd:element></xsd:sequence></xsd:complexType></xsd:element></xsd:sequence></xsd:complexType></xsd:schema></wsdl:types><wsdl:message
name="MTO_Corporate_Payment_WebService"><wsdl:documentation/><wsdl:part
name="MTO_Corporate_Payment_WebService"
element="p1:MTO_Corporate_Payment_WebService"/></wsdl:message><wsdl:portType
name="SIOA_Corporate_Payment_WebService"><wsdl:documentation/><wsdl:operation
name="SIOA_Corporate_Payment_WebService"><wsdl:documentation/><wsp:Policy><wsp:PolicyReference
URI="#OP_SIOA_Corporate_Payment_WebService"/></wsp:Policy><wsdl:input
message="p1:MTO_Corporate_Payment_WebService"/></wsdl:operation></wsdl:portType><wsdl:binding
name="SIOA_Corporate_Payment_WebServiceBinding"
type="p1:SIOA_Corporate_Payment_WebService"><soap:binding
style="document" transport="http://schemas.xmlsoap.org/soap/http"
xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"/><wsdl:operation
name="SIOA_Corporate_Payment_WebService"><soap:operation
soapAction="http://sap.com/xi/WebService/soap1.1"
xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"/><wsdl:input><soap:body
use="literal"
xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"/></wsdl:input></wsdl:operation></wsdl:binding></wsdl:definitions>